; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v11 ?v2)
             (pred_9 ?v1 ?v7)
             (pred_6 ?v11 ?v7)
             (pred_10 ?v8 ?v11 )
	     (pred_1 ?v11)
             (pred_4 ?v4)
             (pred_8 ?v1)
             (pred_3 ?v7)
             (pred_12 ?v11)
             (pred_5 ?v1)
             (pred_11 ?v11)
             (pred_2 ))



(:action op_4
:parameters (?v6 ?v10 ?v12 ?v3)
:precondition (and (pred_4 ?v6) (pred_4 ?v10) (pred_8 ?v12) (pred_3 ?v3)
          (pred_7 ?v6 ?v10) (pred_9 ?v12 ?v3)
                   (pred_6 ?v10 ?v3) (pred_1 ?v6) 
                   (pred_12 ?v10) (pred_5 ?v12))
:effect (and  (pred_11 ?v10) (not (pred_12 ?v10))))


(:action op_5
:parameters (?v6 ?v13)
:precondition (and (pred_4 ?v6) (pred_4 ?v13)
               (pred_1 ?v6) (pred_7 ?v6 ?v13) (pred_11 ?v13))
:effect (and (pred_1 ?v13) (not (pred_1 ?v6))))

(:action op_2
:parameters (?v6 ?v12)
:precondition (and (pred_4 ?v6) (pred_8 ?v12) 
                  (pred_1 ?v6) (pred_10 ?v12 ?v6) (pred_2 ))
:effect (and (pred_5 ?v12)
   (not (pred_10 ?v12 ?v6)) (not (pred_2 ))))


(:action op_1
:parameters (?v6 ?v9 ?v5)
:precondition (and (pred_4 ?v6) (pred_8 ?v9) (pred_8 ?v5)
                  (pred_1 ?v6) (pred_5 ?v5) (pred_10 ?v9 ?v6))
:effect (and (pred_5 ?v9) (pred_10 ?v5 ?v6)
        (not (pred_5 ?v5)) (not (pred_10 ?v9 ?v6))))

(:action op_3
:parameters (?v6 ?v12)
:precondition (and (pred_4 ?v6) (pred_8 ?v12) 
                  (pred_1 ?v6) (pred_5 ?v12))
:effect (and (pred_2 ) (pred_10 ?v12 ?v6) (not (pred_5 ?v12)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_30 obj_25 obj_21 obj_24 obj_19 obj_06 obj_13 obj_31 obj_12 obj_15 obj_08 obj_20 obj_10 obj_29 obj_03 obj_14 obj_27 obj_28 obj_16 obj_02 obj_11 obj_04 obj_22 obj_23 obj_26
    obj_05 obj_07 obj_01
    obj_18 obj_17 obj_09
    )

    (:init
       (pred_2)

       (pred_4 obj_30)
       (pred_4 obj_25)
       (pred_4 obj_21)
       (pred_4 obj_24)
       (pred_4 obj_19)
       (pred_4 obj_06)
       (pred_4 obj_13)
       (pred_4 obj_31)
       (pred_4 obj_12)
       (pred_4 obj_15)
       (pred_4 obj_08)
       (pred_4 obj_20)
       (pred_4 obj_10)
       (pred_4 obj_29)
       (pred_4 obj_03)
       (pred_4 obj_14)
       (pred_4 obj_27)
       (pred_4 obj_28)
       (pred_4 obj_16)
       (pred_4 obj_02)
       (pred_4 obj_11)
       (pred_4 obj_04)
       (pred_4 obj_22)
       (pred_4 obj_23)
       (pred_4 obj_26)
       (pred_3 obj_05)
       (pred_3 obj_07)
       (pred_3 obj_01)
       (pred_8 obj_18)
       (pred_8 obj_17)
       (pred_8 obj_09)

       (pred_7 obj_30 obj_06)
       (pred_7 obj_30 obj_25)
       (pred_7 obj_25 obj_13)
       (pred_7 obj_25 obj_21)
       (pred_7 obj_25 obj_30)
       (pred_7 obj_21 obj_31)
       (pred_7 obj_21 obj_24)
       (pred_7 obj_21 obj_25)
       (pred_7 obj_24 obj_12)
       (pred_7 obj_24 obj_19)
       (pred_7 obj_24 obj_21)
       (pred_7 obj_19 obj_15)
       (pred_7 obj_19 obj_24)
       (pred_7 obj_06 obj_08)
       (pred_7 obj_06 obj_13)
       (pred_7 obj_06 obj_30)
       (pred_7 obj_13 obj_20)
       (pred_7 obj_13 obj_31)
       (pred_7 obj_13 obj_25)
       (pred_7 obj_13 obj_06)
       (pred_7 obj_31 obj_10)
       (pred_7 obj_31 obj_12)
       (pred_7 obj_31 obj_21)
       (pred_7 obj_31 obj_13)
       (pred_7 obj_12 obj_29)
       (pred_7 obj_12 obj_15)
       (pred_7 obj_12 obj_24)
       (pred_7 obj_12 obj_31)
       (pred_7 obj_15 obj_03)
       (pred_7 obj_15 obj_19)
       (pred_7 obj_15 obj_12)
       (pred_7 obj_08 obj_14)
       (pred_7 obj_08 obj_20)
       (pred_7 obj_08 obj_06)
       (pred_7 obj_20 obj_27)
       (pred_7 obj_20 obj_10)
       (pred_7 obj_20 obj_13)
       (pred_7 obj_20 obj_08)
       (pred_7 obj_10 obj_28)
       (pred_7 obj_10 obj_29)
       (pred_7 obj_10 obj_31)
       (pred_7 obj_10 obj_20)
       (pred_7 obj_29 obj_16)
       (pred_7 obj_29 obj_03)
       (pred_7 obj_29 obj_12)
       (pred_7 obj_29 obj_10)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_03 obj_15)
       (pred_7 obj_03 obj_29)
       (pred_7 obj_14 obj_11)
       (pred_7 obj_14 obj_27)
       (pred_7 obj_14 obj_08)
       (pred_7 obj_27 obj_04)
       (pred_7 obj_27 obj_28)
       (pred_7 obj_27 obj_20)
       (pred_7 obj_27 obj_14)
       (pred_7 obj_28 obj_22)
       (pred_7 obj_28 obj_16)
       (pred_7 obj_28 obj_10)
       (pred_7 obj_28 obj_27)
       (pred_7 obj_16 obj_23)
       (pred_7 obj_16 obj_02)
       (pred_7 obj_16 obj_29)
       (pred_7 obj_16 obj_28)
       (pred_7 obj_02 obj_26)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_02 obj_16)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_11 obj_14)
       (pred_7 obj_04 obj_22)
       (pred_7 obj_04 obj_27)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_22 obj_23)
       (pred_7 obj_22 obj_28)
       (pred_7 obj_22 obj_04)
       (pred_7 obj_23 obj_26)
       (pred_7 obj_23 obj_16)
       (pred_7 obj_23 obj_22)
       (pred_7 obj_26 obj_02)
       (pred_7 obj_26 obj_23)
       (pred_12 obj_03)
       (pred_12 obj_08)
       (pred_12 obj_27)
       (pred_6  obj_03 obj_05)
       (pred_6  obj_08 obj_07)
       (pred_6  obj_27 obj_01)
       (pred_11 obj_30)
       (pred_11 obj_25)
       (pred_11 obj_21)
       (pred_11 obj_24)
       (pred_11 obj_19)
       (pred_11 obj_06)
       (pred_11 obj_13)
       (pred_11 obj_31)
       (pred_11 obj_12)
       (pred_11 obj_15)
       (pred_11 obj_20)
       (pred_11 obj_10)
       (pred_11 obj_29)
       (pred_11 obj_14)
       (pred_11 obj_28)
       (pred_11 obj_16)
       (pred_11 obj_02)
       (pred_11 obj_11)
       (pred_11 obj_04)
       (pred_11 obj_22)
       (pred_11 obj_23)
       (pred_11 obj_26)

       (pred_9  obj_18 obj_05)
       (pred_9  obj_17 obj_07)
       (pred_9  obj_09 obj_01)
       (pred_10 obj_18 obj_25)
       (pred_10 obj_17 obj_15)
       (pred_10 obj_09 obj_21)
       (pred_1 obj_10)
    )

    (:goal (and
       (pred_10 obj_18 obj_14)
       (pred_10 obj_17 obj_21)
    ))
(:constraints
  (always (not (pred_1 obj_13)))
)
)

; plan
1. (op_5 obj_10 obj_31)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_31)
   goals met: 0 of 2
2. (op_5 obj_31 obj_12)
   deleted: (pred_1 obj_31)
   added: (pred_1 obj_12)
   goals met: 0 of 2
3. (op_5 obj_12 obj_15)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_15)
   goals met: 0 of 2
4. (op_2 obj_15 obj_17)
   deleted: (pred_10 obj_17 obj_15) (pred_2)
   added: (pred_5 obj_17)
   goals met: 0 of 2
5. (op_5 obj_15 obj_19)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_19)
   goals met: 0 of 2
6. (op_5 obj_19 obj_24)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_24)
   goals met: 0 of 2
7. (op_5 obj_24 obj_21)
   deleted: (pred_1 obj_24)
   added: (pred_1 obj_21)
   goals met: 0 of 2
8. (op_1 obj_21 obj_09 obj_17)
   deleted: (pred_5 obj_17) (pred_10 obj_09 obj_21)
   added: (pred_5 obj_09) (pred_10 obj_17 obj_21)
   goals met: 1 of 2
9. (op_5 obj_21 obj_25)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_25)
   goals met: 1 of 2
10. (op_1 obj_25 obj_18 obj_09)
   deleted: (pred_5 obj_09) (pred_10 obj_18 obj_25)
   added: (pred_5 obj_18) (pred_10 obj_09 obj_25)
   goals met: 1 of 2
11. (op_5 obj_25 obj_21)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_21)
   goals met: 1 of 2
12. (op_5 obj_21 obj_31)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_31)
   goals met: 1 of 2
13. (op_5 obj_31 obj_10)
   deleted: (pred_1 obj_31)
   added: (pred_1 obj_10)
   goals met: 1 of 2
14. (op_5 obj_10 obj_28)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_28)
   goals met: 1 of 2
15. (op_5 obj_28 obj_22)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_22)
   goals met: 1 of 2
16. (op_5 obj_22 obj_04)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_04)
   goals met: 1 of 2
17. (op_5 obj_04 obj_11)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_11)
   goals met: 1 of 2
18. (op_5 obj_11 obj_14)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_14)
   goals met: 1 of 2
19. (op_3 obj_14 obj_18)
   deleted: (pred_5 obj_18)
   added: (pred_2) (pred_10 obj_18 obj_14)
   goals met: 2 of 2
